Autodesk.AdvanceSteel.ConstructionTypes.UserDefinedConnection.ReplaceDrivenObjects(System.Collections.Generic.List`1{Autodesk.AdvanceSteel.CADLink.Database.ObjectId})
Replace the collection of the created objects.
newIds:  New created objects list

Autodesk.AdvanceSteel.ConstructionTypes.UserDefinedConnection.Drivens
Drivens include also created joints.

Autodesk.AdvanceSteel.ConstructionTypes.UserDefinedConnection.Name
Template connection name.

Autodesk.AdvanceSteel.ConstructionTypes.UserDefinedConnection.CreateTemplate(Autodesk.AdvanceSteel.DocumentManagement.OpenDatabase,System.String,Autodesk.AdvanceSteel.Modelling.Beam,Autodesk.AdvanceSteel.Modelling.Beam,Autodesk.AdvanceSteel.Modelling.Beam,System.Collections.Generic.List`1{Autodesk.AdvanceSteel.CADLink.Database.ObjectId})
Create user defined connection template for three beams situation.
db: The database to store the template
templateName:  The name that uniquely identifies the template
beam1:  Input driver beam
beam2:  Input driver beam
beam3:  Input driver beam
drivens:  Connection created objects
Returns:  Return the created user connection template object

Autodesk.AdvanceSteel.ConstructionTypes.UserDefinedConnection.CreateTemplate(Autodesk.AdvanceSteel.DocumentManagement.OpenDatabase,System.String,Autodesk.AdvanceSteel.Modelling.Beam,Autodesk.AdvanceSteel.Modelling.Beam,System.Collections.Generic.List`1{Autodesk.AdvanceSteel.CADLink.Database.ObjectId})
Create user defined connection template for two beams situation.
db: The database to store the template
templateName:  The name that uniquely identifies the template
beam1:  Input driver beam
beam2:  Input driver beam
drivens:  Connection created objects
Returns:  Return the created user connection template object

Autodesk.AdvanceSteel.ConstructionTypes.UserDefinedConnection.CreateTemplate(Autodesk.AdvanceSteel.DocumentManagement.OpenDatabase,System.String,Autodesk.AdvanceSteel.Modelling.Beam,Autodesk.AdvanceSteel.Modelling.UserDefinedPoint,System.Collections.Generic.List`1{Autodesk.AdvanceSteel.CADLink.Database.ObjectId})
Create user defined connection template for one beam and one user point situation.
db: The database to store the template
templateName:  The name that uniquely identifies the template
beam:  Input driver beam
pt:  Input user defined point
drivens:  Connection created objects
Returns:  Return the created user connection template object

Autodesk.AdvanceSteel.ConstructionTypes.UserDefinedConnection.CreateTemplate(Autodesk.AdvanceSteel.DocumentManagement.OpenDatabase,System.String,Autodesk.AdvanceSteel.Modelling.Beam,Autodesk.AdvanceSteel.Modelling.Beam.eEnd,System.Collections.Generic.List`1{Autodesk.AdvanceSteel.CADLink.Database.ObjectId})
Create user defined connection template for one beam and one beam end situation.
db: The database to store the template
templateName:  The name that uniquely identifies the template
beam:  Input driver beam
beamEnd:  Input driver beam end
drivens:  Connection created objects
Returns:  Return the created user connection template object